RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
/***************************************************************************//**
* \file cyhal_ipc.c
*
* \brief
* Provides a high level interface for interacting with the Infineon Inter Processor Communication.
* This interface abstracts out the chip specific details. If any chip specific
* functionality is necessary, or performance is critical the low level functions
* can be used directly.
*
********************************************************************************
* \copyright
* Copyright 2018-2022 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_ipc_drv.h"
#include "cy_ipc_pipe.h"
#include "cy_ipc_sema.h"
#include "cyhal_ipc.h"
#include "cyhal_ipc_impl.h"
#include "cyhal_system.h"
#include "cyhal_irq_impl.h"
#if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
#include "cyabs_rtos.h"
#endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */

#include <string.h>

#if (CYHAL_DRIVER_AVAILABLE_IPC)

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_hal_impl_ipc IPC (Inter-Processor Communication)
* \ingroup group_hal_impl
* \{
* \section section_hal_impl_ipc_preemtable_sema Preemtable Semaphore parameter
* If preemptable parameter is enabled (true) for semaphore, the user must ensure that there are no deadlocks in the
* system, which can be caused by an interrupt that occurs after the IPC channel is locked. Unless the user is ready to
* handle IPC channel locks correctly at the application level, set preemptable to false.
*
* \section section_hal_impl_ipc_interrupts_priorities IPC interrupts implementation and priorities
* In current HAL IPC implementation, each core has its "own" IPC INTR structure, which services all possible HAL IPC
* channels. Due to that, callbacks (interrupts) priorities are not flexible in configuration, which means that
* priority, set by \ref cyhal_ipc_queue_enable_event function, will only be applied, if it is lower,
* than the one, which is currently applied for the source (IPC INTR structure), that services interrupts for current
* core. Priority is being applied core-wide, for all channels and queue numbers.
*
* \section section_hal_impl_ipc_queue_operation_isr IPC queues operations in ISR context
* In current HAL IPC implementation, due to multi-core interrupts synchronization specifics, IPC queue put/get operations
* cannot be performed in callbacks (ISR context). Such operations will end with \ref CYHAL_IPC_RSLT_ERR_CANT_OPERATE_IN_ISR
* error code generation.
*
* \section section_hal_impl_ipc_last_sema_occupied Last available IPC semaphore is occupied by HAL IPC
* Last available IPC semaphore (_CYHAL_IPC_PDL_SEMA_COUNT - 1) is occupied by multi-core interrupt synchronization mechanism
* and is not available for user.
*
* \section section_hal_impl_ipc_semaphores_initialization On some devices (currently, CAT1C and CAT1D devices), startup
* code does not initialize IPC PDL driver semaphores, so it is done by cyhal_ipc_semaphore_init() function, which
* requires one device core call cyhal_ipc_semaphore_init() prior to other cores. By default, for CAT1C, CM7_0 should
* call this function before other cores, while on CAT1D - CM55 core. This can be changed by user by defining
* `CYHAL_IPC_INIT_CORE` with required core name. For example, definition of CYHAL_IPC_INIT_CORE to be equal
* CORE_NAME_CM7_1 will make cyhal_ipc_semaphore_init() on CAT1C device initialize IPC PDL semaphores on CM7_1 core.
* Note: Defines `CORE_NAME_*` are being generated for each device by corresponding recipe-make-* asset.
*
* \} group_hal_impl_ipc
*/

typedef struct
{
    uint8_t *isr_enable_sync;
    uint8_t *isr_clear_sync;
    cyhal_ipc_queue_t *queues_ll_pointer;
} _cyhal_ipc_sevice_data_t;

_cyhal_ipc_sevice_data_t *_cyhal_ipc_service_data = NULL;

/* Step in us between IPC semaphore unsuccessful takes when performing
*  internal IPC service tasks. */
#define _CYHAL_IPC_SERVICE_SEMA_STEP_US         (100)
/* IPC semaphore timeout when performing internal IPC service tasks */
#define _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US      (2000)
/* IPC semaphore acquire / give  tries */
#define _CYHAL_IPC_SERVICE_SEMA_TRIES           (100)

#if (CYHAL_IPC_USR_CHANNELS <= 8)
    #define _CYHAL_IPC_FIX_CHAN_NUM(channel)                    (channel - CYHAL_IPC_CHAN_0)
    #define _CYHAL_IPC_BIT_ENABLE(variable, channel, core)      variable[core] |= (1 << _CYHAL_IPC_FIX_CHAN_NUM(channel))
    #define _CYHAL_IPC_BIT_DISABLE(variable, channel, core)     variable[core] &= ~(1 << _CYHAL_IPC_FIX_CHAN_NUM(channel))
    #define _CYHAL_IPC_CHECK_BIT(variable, channel, core)       ((variable[core] & (1 << _CYHAL_IPC_FIX_CHAN_NUM(channel))) != 0)
    #define _CYHAL_IPC_CHECK_BIT_NOT(variable, channel, core)   ((variable[core] & (1 << _CYHAL_IPC_FIX_CHAN_NUM(channel))) == 0)

    /* Set ISR Enabled */
    #define _CYHAL_IPC_SIE(channel, core)       _CYHAL_IPC_BIT_ENABLE(_cyhal_ipc_service_data->isr_enable_sync, channel, core)
    /* Set ISR Disabled */
    #define _CYHAL_IPC_SID(channel, core)       _CYHAL_IPC_BIT_DISABLE(_cyhal_ipc_service_data->isr_enable_sync, channel, core)
    /* Is ISR Enabled */
    #define _CYHAL_IPC_IIE(channel, core)       _CYHAL_IPC_CHECK_BIT(_cyhal_ipc_service_data->isr_enable_sync, channel, core)
    /* Set ISR (ISR is expected) */
    #define _CYHAL_IPC_SI(channel, core)        _CYHAL_IPC_BIT_ENABLE(_cyhal_ipc_service_data->isr_clear_sync, channel, core)
    /* Clear ISR (ISR is handled and cleared) */
    #define _CYHAL_IPC_CI(channel, core)        _CYHAL_IPC_BIT_DISABLE(_cyhal_ipc_service_data->isr_clear_sync, channel, core)
    /* Is ISR Serviced */
    #define _CYHAL_IPC_IIS(channel, core)       _CYHAL_IPC_CHECK_BIT_NOT(_cyhal_ipc_service_data->isr_clear_sync, channel, core)
#else
    #error "Unhandled number of IPC channels"
#endif /* CYHAL_IPC_USR_CHANNELS <= 8 or other */

