RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
#if defined(COMPONENT_CAT1A)
/* Number of cores being serviced by the driver */
#define _CYHAL_IPC_CORE_NUM                         (2)
#define _CYHAL_IPC_CM0P_IDX                         (0)
#define _CYHAL_IPC_CM4_IDX                          (1)

/* IPC INTR of HAL IPC CHAN 0 is used to service interrupts on CM0p, IPC_CHAN 1 is used for CM4 */
#define _CYHAL_IPC_TRIGGER_ISR_MASK                 ((1UL << CYHAL_IPC_CHAN_0) | (1UL << CYHAL_IPC_CHAN_1))
#if (CY_CPU_CORTEX_M0P)
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_0)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM0P_IDX)
#define _CYHAL_IPC_OTHER_CORE_IDX                   (_CYHAL_IPC_CM4_IDX)
#else /* CY_CPU_CORTEX_M4 */
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_1)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM4_IDX)
#define _CYHAL_IPC_OTHER_CORE_IDX                   (_CYHAL_IPC_CM0P_IDX)
#endif /* CY_CPU_CORTEX_M0P or CY_CPU_CORTEX_M4 */

#elif defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
/* Number of cores being serviced by the driver */
#define _CYHAL_IPC_CORE_NUM                         (3)

#if defined(COMPONENT_CAT1C)
#define _CYHAL_IPC_CM0P_IDX                         (0)
#define _CYHAL_IPC_CM7_0_IDX                        (1)
#define _CYHAL_IPC_CM7_1_IDX                        (2)

#if (CY_CPU_CORTEX_M0P)
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_0)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM0P_IDX)
#define _CYHAL_IPC_OTHER_CORE_0_IDX                 (_CYHAL_IPC_CM7_0_IDX)
#define _CYHAL_IPC_OTHER_CORE_1_IDX                 (_CYHAL_IPC_CM7_1_IDX)
#elif (CY_CPU_CORTEX_M7)
#if (CORE_NAME_CM7_0)
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_1)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM7_0_IDX)
#define _CYHAL_IPC_OTHER_CORE_0_IDX                 (_CYHAL_IPC_CM0P_IDX)
#define _CYHAL_IPC_OTHER_CORE_1_IDX                 (_CYHAL_IPC_CM7_1_IDX)
#elif (CORE_NAME_CM7_1)
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_2)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM7_1_IDX)
#define _CYHAL_IPC_OTHER_CORE_0_IDX                 (_CYHAL_IPC_CM0P_IDX)
#define _CYHAL_IPC_OTHER_CORE_1_IDX                 (_CYHAL_IPC_CM7_0_IDX)
#else
#error "Unable to determine CM7 core index"
#endif /* defined (ACTIVE_CORE_CM7_0) or defined (ACTIVE_CORE_CM7_0) or error */
#endif /* CY_CPU_CORTEX_M0P or CY_CPU_CORTEX_M7 */
#else
#define _CYHAL_IPC_CM33_IDX                         (0)
#define _CYHAL_IPC_CM55_IDX                         (1)
#define _CYHAL_IPC_CU55_IDX                         (2)
#if (CY_CPU_CORTEX_M33)
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_0)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM33_IDX)
#define _CYHAL_IPC_OTHER_CORE_0_IDX                 (_CYHAL_IPC_CM55_IDX)
#define _CYHAL_IPC_OTHER_CORE_1_IDX                 (_CYHAL_IPC_CU55_IDX)
#elif (CY_CPU_CORTEX_M55)
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_1)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CM55_IDX)
#define _CYHAL_IPC_OTHER_CORE_0_IDX                 (_CYHAL_IPC_CM33_IDX)
#define _CYHAL_IPC_OTHER_CORE_1_IDX                 (_CYHAL_IPC_CU55_IDX)
#else
#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN       (CYHAL_IPC_CHAN_2)
#define _CYHAL_IPC_CUR_CORE_IDX                     (_CYHAL_IPC_CU55_IDX)
#define _CYHAL_IPC_OTHER_CORE_0_IDX                 (_CYHAL_IPC_CM33_IDX)
#define _CYHAL_IPC_OTHER_CORE_1_IDX                 (_CYHAL_IPC_CM55_IDX)
#endif /* CY_CPU_CORTEX_M33 or CY_CPU_CORTEX_M55 or other */
#endif /* defined(COMPONENT_CAT1C) or other */

#define _CYHAL_IPC_TRIGGER_ISR_MASK                 ((1UL << CYHAL_IPC_CHAN_0) | (1UL << CYHAL_IPC_CHAN_1) | (1UL << CYHAL_IPC_CHAN_2))
#else /* !defined(COMPONENT_CAT1A) */
    #error "Unhandled device"
#endif /* defined(COMPONENT_CAT1A) */

#define _CYHAL_IPC_CURRENT_CORE_IPC_INTR_SRC        ((_cyhal_system_irq_t)(cpuss_interrupts_ipc_0_IRQn + _CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN))

/*
*  Macro to work with triggered events and their signatures.
*  Such operations are being performed by IPC queue functions, that can provoke interrupts.
*  Signatures are the bits in corresponding bitfields, that are being inverted each
*  time new event is being generated. They are needed to make IPC irq handler be able
*  to understand whether a certain event was already passed to a user's callback or not. This mechanism works
*  in the following way:
*   - Queue modification function sets the triggered event and swaps the inverse bit
*   - irq handler compares the current signature with that previously passed to the user. If they differ, pass the event to the user. If not, then
*   ignore the event; Store the processed signature.
*
*/

/* How many bits are used to store events / their signatures */
#define _CYHAL_IPC_EVENTS_SIGNATURES_BITS           (16UL)
#define _CYHAL_IPC_EVENTS_MASK                      ((1UL << _CYHAL_IPC_EVENTS_SIGNATURES_BITS) - 1)
#define _CYHAL_IPC_SIGNATURES_MASK                  (_CYHAL_IPC_EVENTS_MASK << _CYHAL_IPC_EVENTS_SIGNATURES_BITS)
/* Add event into triggered events list and change signature */
#define _CYHAL_IPC_ADD_TRIGGERED_EVENT(var, event)  var |= event; var ^= (event << _CYHAL_IPC_EVENTS_SIGNATURES_BITS)
/* Get triggered events w/o signatures */
#define _CYHAL_IPC_GET_TRIGGERED_EVENT(var)         (var & _CYHAL_IPC_EVENTS_MASK)
/* Get signatures w/o triggered events */
#define _CYHAL_IPC_GET_SIGNATURES(var)              (((var) & _CYHAL_IPC_SIGNATURES_MASK) >> _CYHAL_IPC_EVENTS_SIGNATURES_BITS)
/* Remove triggered events (not signatures touched) */
#define _CYHAL_IPC_RMV_TRIGGERED_EVENT(var, event)  var &= ~event
/* Clear triggered events, but not signatures */
#define _CYHAL_IPC_CLR_TRIGGERED_EVENT(var)         var &= _CYHAL_IPC_SIGNATURES_MASK

cyhal_ipc_t *_ipc_objects[CYHAL_IPC_USR_CHANNELS];
bool interrupts_initialized = false;
bool semas_initialized = false;

