RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
/* As _ipc_objects stores only info about user-accessible IPC channels, we need to apply offset when accessing the array */
#define _CYHAL_IPC_OBJ_ARR_EL(channel_num)  (_ipc_objects[(channel_num - CYHAL_IPC_CHAN_0)])

#if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
#if defined(CY_IPC_INTR_SPARE)
#define _CYHAL_IPC_SEMA_INTR_STR_NUM                (CY_IPC_INTR_SPARE)
#elif defined(CY_IPC_INTR_USER) && (CY_IPC_INTR_USER < CY_IPC_CHAN_USER)
#define _CYHAL_IPC_SEMA_INTR_STR_NUM                (CY_IPC_INTR_USER)
#else
#error "Cannot determine IPC INTR struct for semaphores"
#endif /* defined(CY_IPC_INTR_SPARE) or defined(CY_IPC_CHAN_USER) or other */

#if (_CYHAL_IPC_SEMA_INTR_STR_NUM >= CYHAL_IPC_CHAN_0)
#error "Cannot proceed with overlapping SEMA and QUEUE interrupts"
#endif /* (CY_IPC_INTR_SPARE >= CYHAL_IPC_CHAN_0) */

typedef struct
{
    cy_semaphore_t semaphore;
    uint32_t sema_num;
    bool initialized;
} _cyhal_ipc_rtos_sema_t;

static _cyhal_ipc_rtos_sema_t _cyhal_ipc_rtos_semaphores[CYHAL_IPC_RTOS_SEMA_NUM] = { 0 };
#endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */

/*************************************** INTERNAL FUNCTIONS PROTOTYPES *************************************************/

static void _cyhal_ipc_irq_handler(void);
static cy_rslt_t _cyhal_ipc_sema_take(cyhal_ipc_t *obj, uint32_t *timeout_us, uint32_t step_us);
static void _cyhal_ipc_wait_step(uint32_t *timeout_us, uint32_t polling_interval_us);

/********************************************* SEMAPHORE HELPERS *******************************************************/

#if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)

/* Is any of RTOS semaphores was initialized previously? */
bool _cyhal_ipc_rtos_is_any_sema_initialized()
{
    for (size_t sema_idx = 0; sema_idx < CYHAL_IPC_RTOS_SEMA_NUM; ++sema_idx)
    {
        if (_cyhal_ipc_rtos_semaphores[sema_idx].initialized)
        {
            return true;
        }
    }
    return false;
}

size_t _cyhal_ipc_rtos_get_rtos_sema_index(void *sema_address)
{
    for (size_t sema_idx = 0; sema_idx < CYHAL_IPC_RTOS_SEMA_NUM; ++sema_idx)
    {
        if ((void *)&_cyhal_ipc_rtos_semaphores[sema_idx] == sema_address)
        {
            return sema_idx;
        }
    }
    CY_ASSERT(false);
    return 0;
}

#endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */

static cy_rslt_t _cyhal_ipc_sema_init(cyhal_ipc_t *obj, uint32_t semaphore_num, bool preemptable)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* On CAT1C and CAT1D devices, unlike CAT1A devices, startup code does not initialized IPC PDL semaphore and
    *  does not allocate shared memory for them. */
    #if defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    if (false == semas_initialized)
    {
        #if (CYHAL_IPC_INIT_CORE)
        CY_SECTION_SHAREDMEM
        static uint32_t ipc_sema_array[_CYHAL_IPC_PDL_SEMA_COUNT / CY_IPC_SEMA_PER_WORD]
        #if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
        CY_ALIGN(__SCB_DCACHE_LINE_SIZE)
        #endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
        ;
        result = (cy_rslt_t)Cy_IPC_Sema_Init(CY_IPC_CHAN_SEMA, _CYHAL_IPC_PDL_SEMA_COUNT, ipc_sema_array);
        #else
        result = (cy_rslt_t)Cy_IPC_Sema_Init(CY_IPC_CHAN_SEMA, 0, NULL);
        #endif /* CYHAL_IPC_INIT_CORE or other */
        if (CY_RSLT_SUCCESS == result)
        {
            semas_initialized = true;
        }
    }
    #endif /* defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D) */

    if (CY_RSLT_SUCCESS == result)
    {
        obj->sema_preemptable = preemptable;
        obj->sema_number = semaphore_num;
        #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
        obj->rtos_sema = NULL;
        #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */
    }

    return result;
}

/*
    step_us - for how long to wait between unsuccessful IPC sema takes
    use_rtos_sema - whether RTOS semaphores should be used in RTOS environment
*/
static cy_rslt_t _cyhal_ipc_sema_take(cyhal_ipc_t *obj, uint32_t *timeout_us, uint32_t step_us)
{
    cy_rslt_t result = ~CY_RSLT_SUCCESS;
    bool is_never_timeout = (*timeout_us == CYHAL_IPC_NEVER_TIMEOUT);

    #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
    cy_rslt_t rtos_sema_result = CY_RSLT_SUCCESS;
    if (NULL != obj->rtos_sema)
    {
        /* Using RTOS semaphore as mechanism to most effectively wait for IPC semaphore to be free. */

        /* When using an RTOS if a cyhal_ipc_semaphore_take api is called from and ISR in
        * in certain RTOSes cy_rtos_get_semaphore returns immediately without blocking. So we can
        * either busy wait around the semaphore being set in the ISR or use the normal polling method
        * we use in the non-RTOS case. For simplicity and to avoid the calling ISR from depending on
        * the IPC ISR priority we use the normal polling method.
        */
        bool in_isr = (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;
        if (((*timeout_us >= 1000) || is_never_timeout) && (false == in_isr))
        {
            while ((result = (cy_rslt_t)Cy_IPC_Sema_Set(obj->sema_number, obj->sema_preemptable)) == (cy_rslt_t)CY_IPC_SEMA_LOCKED)
            {
                _cyhal_ipc_wait_step(is_never_timeout ? NULL : timeout_us, step_us);
            }
            if ((cy_rslt_t)CY_IPC_SEMA_LOCKED != result)
            {
                bool sema_not_yet_available = ((cy_rslt_t)CY_IPC_SEMA_NOT_ACQUIRED == result);
                if (sema_not_yet_available)
                {
                    _cyhal_irq_enable((_cyhal_system_irq_t)(cpuss_interrupts_ipc_0_IRQn + _CYHAL_IPC_SEMA_INTR_STR_NUM));

                    if (is_never_timeout)
                    {
                        while (CY_RSLT_SUCCESS != result)
                        {
                            uint32_t timeout_ms = CYHAL_IPC_POLLING_INTERVAL_uS / 1000;
                            if (timeout_ms == 0)
                            {
                                ++timeout_ms;
                            }
                            /* cy_rtos_get_semaphore works here as advanced delay mechanism, which in RTOS environment
                            *  helps utilize CPU in most efficient way while we are waiting for IPC Semaphore to be given.
                            *  Only unexpected return codes (expected are CY_RSLT_SUCCESS and CY_RTOS_TIMEOUT) will
                            *  be reported to user in case of unsuccessful semaphore take. */
                            rtos_sema_result = cy_rtos_get_semaphore(
                                        &(((_cyhal_ipc_rtos_sema_t *)obj->rtos_sema)->semaphore), timeout_ms, false);
                            result = (cy_rslt_t)Cy_IPC_Sema_Set(obj->sema_number, obj->sema_preemptable);
                        }
                    }
                    else
                    {
                        uint32_t timeout_ms = *timeout_us / 1000;
                        /* cy_rtos_get_semaphore works here as advanced delay mechanism, which in RTOS environment
                        *  helps utilize CPU in most efficient way while we are waiting for IPC Semaphore to be given.
                        *  Only unexpected return codes (expected are CY_RSLT_SUCCESS and CY_RTOS_TIMEOUT) will
                        *  be reported to user in case of unsuccessful semaphore take. */
                        rtos_sema_result = cy_rtos_get_semaphore(
                                    &(((_cyhal_ipc_rtos_sema_t *)obj->rtos_sema)->semaphore), timeout_ms, false);
                        result = (cy_rslt_t)Cy_IPC_Sema_Set(obj->sema_number, obj->sema_preemptable);
                        *timeout_us = 0;
                    }

                    _cyhal_irq_disable((_cyhal_system_irq_t)(cpuss_interrupts_ipc_0_IRQn + _CYHAL_IPC_SEMA_INTR_STR_NUM));
                }
                else
                {
                    result = CY_RSLT_SUCCESS;
                }
            }
        }
    }
    #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */

    if (CY_RSLT_SUCCESS != result)
    {
        while(
            ((result = (cy_rslt_t)Cy_IPC_Sema_Set(obj->sema_number, obj->sema_preemptable)) != CY_RSLT_SUCCESS) &&
            ((*timeout_us != 0) || is_never_timeout)
        )
        {
            _cyhal_ipc_wait_step(is_never_timeout ? NULL : timeout_us, step_us);
        }
    }

    #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
    if (obj->sema_number < _CYHAL_IPC_RELEASE_INTR_BITS)
    {
        IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(_CYHAL_IPC_SEMA_INTR_STR_NUM);
        uint32_t intr_status_masked = _FLD2VAL(IPC_INTR_STRUCT_INTR_MASKED_RELEASE, Cy_IPC_Drv_GetInterruptStatusMasked(ipc_intr_base));
        uint32_t current_sema_intr_mask = 1 << obj->sema_number;
        if ((CY_RSLT_SUCCESS == result) && (intr_status_masked & current_sema_intr_mask))
        {
            /* If semaphore get was successful and interrupt was not cleared by IRQ handler (e.g. interrupts are disabled),
            *   clear pending interrupt, that is related to this semaphore number */
            Cy_IPC_Drv_ClearInterrupt(ipc_intr_base, current_sema_intr_mask, 0);
        }
    }
    /* If IPC semaphore was not successfully got and unexpected result was returned by cy_rtos_get_semaphore,
    *  forward the RTOS result to the user. */
    if ((CY_RSLT_SUCCESS != result) && ((CY_RSLT_SUCCESS != rtos_sema_result) && (CY_RTOS_TIMEOUT != rtos_sema_result)))
    {
        result = rtos_sema_result;
    }
    #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */

    return result;
}


/********************************************** QUEUES HELPERS ********************************************************/

