RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
static cy_rslt_t _cyhal_ipc_acquire_core_sync_sema(cyhal_ipc_t *obj, uint32_t *timeout_us)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != timeout_us);

    return _cyhal_ipc_sema_take(obj, timeout_us, _CYHAL_IPC_SERVICE_SEMA_STEP_US);
}

static cy_rslt_t _cyhal_ipc_give_core_sync_sema(cyhal_ipc_t *obj, uint32_t *timeout_us)
{
    cy_rslt_t result;
    bool is_never_timeout = (*timeout_us == CYHAL_IPC_NEVER_TIMEOUT);
    while ((CY_RSLT_SUCCESS != (result = cyhal_ipc_semaphore_give(obj))) && (is_never_timeout || (*timeout_us != 0)))
    {
        if (is_never_timeout || (*timeout_us > _CYHAL_IPC_SERVICE_SEMA_STEP_US))
        {
            cyhal_system_delay_us(_CYHAL_IPC_SERVICE_SEMA_STEP_US);
            if (false == is_never_timeout)
            {
                *timeout_us -= _CYHAL_IPC_SERVICE_SEMA_STEP_US;
            }
        }
        else
        {
            cyhal_system_delay_us(*timeout_us);
            *timeout_us = 0;
        }
    }
    return result;
}

static cy_rslt_t _cyhal_ipc_clear_interrupt(cyhal_ipc_t *obj, uint32_t isr_source_chan, uint32_t isr_chan)
{
    CY_ASSERT(NULL != obj);

    cy_rslt_t result;
    IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(isr_source_chan);
    uint32_t timeout_acq = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;
    uint32_t timeout_give = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;
    /* We cannot allow interrupt to happen between _cyhal_ipc_acquire_core_sync_sema and successful
    *   _cyhal_ipc_give_core_sync_sema, as interrupt will also attempt to acquire semaphore (which
    *   will obviously fail) */
    uint32_t intr_status = cyhal_system_critical_section_enter();
    if (CY_RSLT_SUCCESS == (result = _cyhal_ipc_acquire_core_sync_sema(obj, &timeout_acq)))
    {
        Cy_IPC_Drv_ClearInterrupt(ipc_intr_base, (1UL << isr_chan), 0);
        _CYHAL_IPC_CI(isr_chan, _CYHAL_IPC_CUR_CORE_IDX);
        result = _cyhal_ipc_give_core_sync_sema(obj, &timeout_give);
    }
    cyhal_system_critical_section_exit(intr_status);
    return result;
}

static bool _cyhal_ipc_check_isr_handled(cyhal_ipc_t *obj, uint32_t channel, uint32_t *timeout)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != timeout);

    bool handled = false;
    /* We cannot allow interrupt to happen between _cyhal_ipc_acquire_core_sync_sema and successful
    *   _cyhal_ipc_give_core_sync_sema, as interrupt will also attempt to acquire semaphore (which
    *   will obviously fail) */
    uint32_t intr_status = cyhal_system_critical_section_enter();
    if (CY_RSLT_SUCCESS == _cyhal_ipc_acquire_core_sync_sema(obj, timeout))
    {
        /* interrupt is disabled for specific channel and core
        *   or (if enabled) interrupt is serviced */
        handled =   (((false == _CYHAL_IPC_IIE(channel, _CYHAL_IPC_CUR_CORE_IDX))
                        || _CYHAL_IPC_IIS(channel, _CYHAL_IPC_CUR_CORE_IDX)) &&
        #if (_CYHAL_IPC_CORE_NUM == 2)
                    ((false == _CYHAL_IPC_IIE(channel, _CYHAL_IPC_OTHER_CORE_IDX))
                        || _CYHAL_IPC_IIS(channel, _CYHAL_IPC_OTHER_CORE_IDX)));
        #elif (_CYHAL_IPC_CORE_NUM == 3)
                    ((false == _CYHAL_IPC_IIE(channel, _CYHAL_IPC_OTHER_CORE_0_IDX))
                        || _CYHAL_IPC_IIS(channel, _CYHAL_IPC_OTHER_CORE_0_IDX)) &&
                    ((false == _CYHAL_IPC_IIE(channel, _CYHAL_IPC_OTHER_CORE_1_IDX))
                        || _CYHAL_IPC_IIS(channel, _CYHAL_IPC_OTHER_CORE_1_IDX)));
        #endif /* (_CYHAL_IPC_CORE_NUM == 2) or (_CYHAL_IPC_CORE_NUM == 3) */
        (void)_cyhal_ipc_give_core_sync_sema(obj, timeout);
    }
    cyhal_system_critical_section_exit(intr_status);
    return handled;
}

static cy_rslt_t _cyhal_ipc_set_isr_expected(cyhal_ipc_t *obj, uint32_t channel)
{
    cy_rslt_t result;
    uint32_t timeout_acq = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;
    uint32_t timeout_give = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;
    /* We cannot allow interrupt to happen between _cyhal_ipc_acquire_core_sync_sema and successful
    *   _cyhal_ipc_give_core_sync_sema, as interrupt will also attempt to acquire semaphore (which
    *   will obviously fail) */
    uint32_t intr_status = cyhal_system_critical_section_enter();
    if (CY_RSLT_SUCCESS == (result = _cyhal_ipc_acquire_core_sync_sema(obj, &timeout_acq)))
    {
        _CYHAL_IPC_SI(channel, _CYHAL_IPC_CUR_CORE_IDX);
        #if (_CYHAL_IPC_CORE_NUM == 2)
        _CYHAL_IPC_SI(channel, _CYHAL_IPC_OTHER_CORE_IDX);
        #elif (_CYHAL_IPC_CORE_NUM == 3)
        _CYHAL_IPC_SI(channel, _CYHAL_IPC_OTHER_CORE_0_IDX);
        _CYHAL_IPC_SI(channel, _CYHAL_IPC_OTHER_CORE_1_IDX);
        #endif /* (_CYHAL_IPC_CORE_NUM == 2) or (_CYHAL_IPC_CORE_NUM == 3) */
        result = _cyhal_ipc_give_core_sync_sema(obj, &timeout_give);
    }
    cyhal_system_critical_section_exit(intr_status);
    return result;
}

static cy_rslt_t _cyhal_ipc_enable_interrupt(cyhal_ipc_t *obj, uint32_t channel, bool enable)
{
    CY_ASSERT(NULL != obj);

    cy_rslt_t result;
    IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(_CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN);
    uint32_t current_ipc_interrupt_mask = Cy_IPC_Drv_GetInterruptMask(ipc_intr_base);
    uint32_t channel_intr_mask = (1UL << channel);
    uint32_t timeout_acq = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;
    uint32_t timeout_give = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;

    /* We cannot allow interrupt to happen between _cyhal_ipc_acquire_core_sync_sema and successful
    *   _cyhal_ipc_give_core_sync_sema, as interrupt will also attempt to acquire semaphore (which
    *   will obviously fail) */
    uint32_t intr_status = cyhal_system_critical_section_enter();
    if (CY_RSLT_SUCCESS == (result = _cyhal_ipc_acquire_core_sync_sema(obj, &timeout_acq)))
    {
        if (enable)
        {
            Cy_IPC_Drv_ClearInterrupt(ipc_intr_base, channel_intr_mask, 0);
            Cy_IPC_Drv_SetInterruptMask(ipc_intr_base, current_ipc_interrupt_mask | channel_intr_mask, 0);
            _CYHAL_IPC_SIE(channel, _CYHAL_IPC_CUR_CORE_IDX);
        }
        else
        {
            Cy_IPC_Drv_SetInterruptMask(ipc_intr_base, current_ipc_interrupt_mask & ~channel_intr_mask, 0);
            _CYHAL_IPC_SID(channel, _CYHAL_IPC_CUR_CORE_IDX);
        }
        result = _cyhal_ipc_give_core_sync_sema(obj, &timeout_give);
    }
    cyhal_system_critical_section_exit(intr_status);
    return result;
}

static cyhal_ipc_queue_t *_cyhal_ipc_find_last_element(cyhal_ipc_queue_t *queue_handle)
{
    CY_ASSERT(NULL != queue_handle);

    cyhal_ipc_queue_t *retval = queue_handle;
    while ((retval->next_queue_obj) != NULL) { retval = retval->next_queue_obj; }
    return retval;
}

static bool _cyhal_ipc_check_queue_number_used(const cyhal_ipc_queue_t *queue_to_be_added)
{
    CY_ASSERT(NULL != queue_to_be_added);

    if ((NULL != _cyhal_ipc_service_data) && (NULL != _cyhal_ipc_service_data->queues_ll_pointer))
    {
        cyhal_ipc_queue_t *queue_handle = _cyhal_ipc_service_data->queues_ll_pointer;
        do
        {
            if ((queue_handle->channel_num == queue_to_be_added->channel_num) &&
                (queue_handle->queue_num == queue_to_be_added->queue_num))
            {
                return true;
            }
        }
        while ((queue_handle = queue_handle->next_queue_obj) != NULL);
    }
    return false;
}

static void _cyhal_ipc_add_queue_element(cyhal_ipc_t *obj, cyhal_ipc_queue_t *queue_handle_to_add)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != queue_handle_to_add);
    CY_ASSERT(NULL != _cyhal_ipc_service_data);

    cyhal_ipc_queue_t *queue_handle = obj->queue_obj;

    /* Fill in service data */
    queue_handle_to_add->curr_items = 0;
    queue_handle_to_add->queue_head = (void *)&(((uint8_t *)(queue_handle_to_add->queue_pool))[0]);
    queue_handle_to_add->queue_tail = (void *)&(((uint8_t *)(queue_handle_to_add->queue_pool))[0]);
    queue_handle_to_add->next_queue_obj = NULL;
    queue_handle_to_add->triggered_events = 0;

    if (NULL != queue_handle)
    {
        cyhal_ipc_queue_t *last_queue_handle = _cyhal_ipc_find_last_element(queue_handle);
        last_queue_handle->next_queue_obj = queue_handle_to_add;
    }
    else
    {
        /* First queue in current cyhal_ipc_t object */
        obj->queue_obj = (void *)queue_handle_to_add;
        if (NULL != _cyhal_ipc_service_data->queues_ll_pointer)
        {
            cyhal_ipc_queue_t *last_queue_handle = _cyhal_ipc_find_last_element(_cyhal_ipc_service_data->queues_ll_pointer);
            last_queue_handle->next_queue_obj = obj->queue_obj;
        }
    }

    if (NULL == _cyhal_ipc_service_data->queues_ll_pointer)
    {
        _cyhal_ipc_service_data->queues_ll_pointer = queue_handle_to_add;
    }
}

static void _cyhal_ipc_wait_step(uint32_t *timeout_us, uint32_t polling_interval_us)
{
    uint32_t us_wait_step = polling_interval_us % 1000;
    uint32_t ms_wait_step = (polling_interval_us - us_wait_step) / 1000;

    if (NULL == timeout_us)
    {
        if (ms_wait_step != 0)
        {
            cyhal_system_delay_ms(ms_wait_step);
        }
        if (us_wait_step != 0)
        {
            cyhal_system_delay_us(us_wait_step);
        }
    }
    else
    {
        if (us_wait_step + (ms_wait_step * 1000) <= *timeout_us)
        {
            if (ms_wait_step != 0)
            {
                cyhal_system_delay_ms(ms_wait_step);
                *timeout_us -= (ms_wait_step * 1000);
            }
            if (us_wait_step != 0)
            {
                cyhal_system_delay_us(us_wait_step);
                *timeout_us -= us_wait_step;
            }
        }
        else if (*timeout_us != 0)
        {
            cyhal_system_delay_us(*timeout_us);
            *timeout_us = 0;
        }
    }
}

static cy_rslt_t _cyhal_ipc_wait_lock_acquire(IPC_STRUCT_Type *ipc_base, uint32_t *timeout_us, bool wait_forever)
{
    CY_ASSERT(NULL != ipc_base);
    cy_rslt_t result;

