RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
    while (((result = (cy_rslt_t)Cy_IPC_Drv_LockAcquire(ipc_base)) != CY_RSLT_SUCCESS) &&
            (wait_forever || ((NULL != timeout_us) && (*timeout_us != 0))))
    {
        _cyhal_ipc_wait_step(wait_forever ? NULL : timeout_us, CYHAL_IPC_POLLING_INTERVAL_uS);
    }

    return result;
}

static cy_rslt_t _cyhal_ipc_queue_put_get(cyhal_ipc_t *obj, void *msg, uint32_t timeout_us, bool put)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != msg);
    CY_ASSERT(NULL != obj->queue_obj);

    if ((SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0)
    {
        return CYHAL_IPC_RSLT_ERR_CANT_OPERATE_IN_ISR;
    }

    bool is_never_timeout = (timeout_us == CYHAL_IPC_NEVER_TIMEOUT);

    cyhal_ipc_queue_t *queue_handle = obj->queue_obj;
    uint32_t channel = obj->queue_obj->channel_num;
    IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(channel);

    uint32_t timeout_us_left = timeout_us;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Used to perform last loop when timeout from non-zero become zero */
    bool last_loop;
    do
    {
        bool is_prev_isr_handled;
        while ((false == (is_prev_isr_handled = _cyhal_ipc_check_isr_handled(obj, channel, &timeout_us_left)))
                && (is_never_timeout || (timeout_us_left != 0)))
        {
            if (is_never_timeout || (timeout_us_left > _CYHAL_IPC_SERVICE_SEMA_STEP_US))
            {
                cyhal_system_delay_us(_CYHAL_IPC_SERVICE_SEMA_STEP_US);
                if (false == is_never_timeout)
                {
                    timeout_us_left -= _CYHAL_IPC_SERVICE_SEMA_STEP_US;
                }
            }
            else
            {
                cyhal_system_delay_us(timeout_us_left);
                timeout_us_left = 0;
            }
        }

        if (false == is_prev_isr_handled)
        {
            /* One or more cores didn't handle previous operation that caused interrupt */
            return CYHAL_IPC_RSLT_ERR_ISR_WAS_NOT_HANDLED;
        }

        last_loop = false;
        result = _cyhal_ipc_wait_lock_acquire(ipc_base, &timeout_us_left, is_never_timeout);

        uint16_t triggered_events = 0;
        if (CY_RSLT_SUCCESS == result)
        {
            _CYHAL_IPC_CLR_TRIGGERED_EVENT(queue_handle->triggered_events);

            if (put)
            {
                if (queue_handle->curr_items < queue_handle->num_items)
                {
                    memcpy(queue_handle->queue_head, msg, queue_handle->item_size);
                    ++queue_handle->curr_items;
                    /* Checking the position of queue_head in roundary buffer. If it is at the end of buffer, moving head to the start */
                    if (((uint32_t)queue_handle->queue_head - (uint32_t)queue_handle->queue_pool) ==
                        (uint32_t)((queue_handle->num_items - 1) * queue_handle->item_size))
                    {
                        queue_handle->queue_head = queue_handle->queue_pool;
                    }
                    else
                    {
                        queue_handle->queue_head = (void *)((uint8_t *)(queue_handle->queue_head) + queue_handle->item_size);
                    }

                    triggered_events = CYHAL_IPC_QUEUE_WRITE;
                    if (queue_handle->curr_items == queue_handle->num_items)
                    {
                        triggered_events |= CYHAL_IPC_QUEUE_FULL;
                    }

                    result = CY_RSLT_SUCCESS;
                }
                else
                {
                    result = CYHAL_IPC_RSLT_ERR_QUEUE_FULL;
                }
            }
            else
            {
                if (queue_handle->curr_items > 0)
                {
                    memcpy(msg, queue_handle->queue_tail, queue_handle->item_size);
                    --queue_handle->curr_items;
                    /* Checking the position of queue_tail in roundary buffer. If it is at the end of buffer, moving tail to the start */
                    if (((uint32_t)(queue_handle->queue_tail) - (uint32_t)(queue_handle->queue_pool)) == (uint32_t)((queue_handle->num_items - 1) * queue_handle->item_size))
                    {
                        queue_handle->queue_tail = queue_handle->queue_pool;
                    }
                    else
                    {
                        queue_handle->queue_tail = (void *)((uint8_t *)(queue_handle->queue_tail) + queue_handle->item_size);
                    }

                    triggered_events = CYHAL_IPC_QUEUE_READ;
                    if (queue_handle->curr_items == 0)
                    {
                        triggered_events |= CYHAL_IPC_QUEUE_EMPTY;
                    }

                    result = CY_RSLT_SUCCESS;
                }
                else
                {
                    result = CYHAL_IPC_RSLT_ERR_QUEUE_EMPTY;
                }
            }

            bool inform_ipcs_via_interrupt = false;
            if ((uint16_t)CYHAL_IPC_NO_INTR != triggered_events)
            {
                inform_ipcs_via_interrupt = true;
                _CYHAL_IPC_ADD_TRIGGERED_EVENT(queue_handle->triggered_events, triggered_events);
                result = _cyhal_ipc_set_isr_expected(obj, channel);
            }

            /* No reason to check the return value, as this function can return either:
            * - CY_IPC_DRV_SUCCESS - if lock was successfully released, or
            * - CY_IPC_DRV_ERROR - if IPC channel was not acquired before the function call, which is impossible in this
            * situation */
            /* No reason to generate interrupt if no events were triggered by performed operation */
            (void)Cy_IPC_Drv_LockRelease(ipc_base, inform_ipcs_via_interrupt ? _CYHAL_IPC_TRIGGER_ISR_MASK : 0u);
        }

        if ((CY_RSLT_SUCCESS != result) && (is_never_timeout || (timeout_us_left != 0)))
        {
            _cyhal_ipc_wait_step(is_never_timeout ? NULL : &timeout_us_left, CYHAL_IPC_POLLING_INTERVAL_uS);
            if ((false == is_never_timeout) && (timeout_us_left == 0))
            {
                last_loop = true;
            }
        }

    } while ((CY_RSLT_SUCCESS != result) && (is_never_timeout || (timeout_us_left != 0) || last_loop));

    return result;
}

