RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
uint16_t _cyhal_ipc_decode_triggered_events(cyhal_ipc_t *obj)
{
    CY_ASSERT(NULL != obj);
    /* Check what events signatures are changed and combine with triggered events */
    uint16_t retval = _CYHAL_IPC_GET_SIGNATURES(obj->queue_obj->triggered_events ^ obj->processed_events) &
        _CYHAL_IPC_GET_TRIGGERED_EVENT(obj->queue_obj->triggered_events);
    obj->processed_events = obj->queue_obj->triggered_events;
    return retval;
}

/********************************* SEMAPHORES / QUEUES IPC INTERRUPT HANDLER********************************************/

static void _cyhal_ipc_irq_handler(void)
{
    _cyhal_system_irq_t irqn = _cyhal_irq_get_active();
    uint32_t isr_channel = irqn - cpuss_interrupts_ipc_0_IRQn;
    IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(isr_channel);
    /* We are interested only in Release events */
    uint32_t interrupt_status_masked =
            _FLD2VAL(IPC_INTR_STRUCT_INTR_MASKED_RELEASE, Cy_IPC_Drv_GetInterruptStatusMasked(ipc_intr_base));

    #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
    if (_CYHAL_IPC_SEMA_INTR_STR_NUM == isr_channel)
    {
        if (interrupt_status_masked != 0)
        {
            for (size_t sema_idx = 0; sema_idx < CYHAL_IPC_RTOS_SEMA_NUM; sema_idx++)
            {
                uint32_t current_sema_mask = 1 << _cyhal_ipc_rtos_semaphores[sema_idx].sema_num;
                if (_cyhal_ipc_rtos_semaphores[sema_idx].initialized && (interrupt_status_masked & current_sema_mask))
                {
                    (void)cy_rtos_set_semaphore(&_cyhal_ipc_rtos_semaphores[sema_idx].semaphore, true);
                    Cy_IPC_Drv_ClearInterrupt(ipc_intr_base, current_sema_mask, 0);
                    break;
                }
            }
        }
    }
    else
    #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */
    if (isr_channel >= CYHAL_IPC_CHAN_0)
    {
        uint32_t channel = CYHAL_IPC_CHAN_0;
        while (interrupt_status_masked != 0)
        {
            uint32_t channel_mask = 1UL << channel;
            if ((interrupt_status_masked & (channel_mask)) != 0)
            {
                interrupt_status_masked &= ~channel_mask;
                cyhal_ipc_t *obj = _CYHAL_IPC_OBJ_ARR_EL(channel);
                if (CY_RSLT_SUCCESS == _cyhal_ipc_clear_interrupt(obj, isr_channel, channel))
                {
                    /* Going through all known cyhal_ipc_t objects, that are tied to the IPC channel, that provoked interrupt */
                    while (obj != NULL)
                    {
                        /* User enabled callback for certain events */
                        if ((obj->user_events != CYHAL_IPC_NO_INTR) && (obj->callback_data.callback != NULL))
                        {
                            /* Check triggered events and (by checking signatures) filter only those events,
                            *   that were not yet processed */
                            uint16_t queue_events = _cyhal_ipc_decode_triggered_events(obj);
                            /* Checking if last operation for certain queue provoked one of the activated by user events */
                            uint16_t activated_occurred_events = obj->user_events & queue_events;
                            if (activated_occurred_events)
                            {
                                cyhal_ipc_event_callback_t callback = (cyhal_ipc_event_callback_t)obj->callback_data.callback;
                                callback(obj->callback_data.callback_arg, (cyhal_ipc_event_t)activated_occurred_events);
                            }
                        }
                        obj = obj->prev_object;
                    }
                }
            }
            channel++;
        }
    }
}

/**************************************** SEMAPHORE PUBLIC FUNCTIONS **************************************************/

cy_rslt_t cyhal_ipc_semaphore_init(cyhal_ipc_t *obj, uint32_t semaphore_num, bool preemptable)
{
    CY_ASSERT(NULL != obj);

    /* Last semaphore is used for internal IPC queues functionality */
    if (semaphore_num >= (_CYHAL_IPC_PDL_SEMA_COUNT - 1))
    {
        /* Semaphore index exceeds the number of allowed Semaphores */
        return CYHAL_IPC_RSLT_ERR_INVALID_PARAMETER;
    }

    cy_rslt_t result = _cyhal_ipc_sema_init(obj, semaphore_num, preemptable);

    #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
    if ((CY_RSLT_SUCCESS == result) && (semaphore_num < _CYHAL_IPC_RELEASE_INTR_BITS))
    {
        /* Looking for free RTOS semaphore from the pre-allocated pool */
        for (size_t rtos_sema_idx = 0; rtos_sema_idx < CYHAL_IPC_RTOS_SEMA_NUM; ++rtos_sema_idx)
        {
            if (false == _cyhal_ipc_rtos_semaphores[rtos_sema_idx].initialized)
            {
                result = cy_rtos_init_semaphore(&(_cyhal_ipc_rtos_semaphores[rtos_sema_idx].semaphore), 1, 0);
                if (CY_RSLT_SUCCESS == result)
                {
                    obj->rtos_sema = (void *)&_cyhal_ipc_rtos_semaphores[rtos_sema_idx];
                    _cyhal_ipc_rtos_semaphores[rtos_sema_idx].initialized = true;
                    _cyhal_ipc_rtos_semaphores[rtos_sema_idx].sema_num = semaphore_num;
                    break;
                }
            }
        }
        if ((CY_RSLT_SUCCESS == result) && (NULL != obj->rtos_sema))
        {
            IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(_CYHAL_IPC_SEMA_INTR_STR_NUM);
            /* Enable all possible interrupt bits for sema interrupt */
            Cy_IPC_Drv_SetInterruptMask(ipc_intr_base, (1 << _CYHAL_IPC_RELEASE_INTR_BITS) - 1, 0);
            _cyhal_irq_register((_cyhal_system_irq_t)(cpuss_interrupts_ipc_0_IRQn + _CYHAL_IPC_SEMA_INTR_STR_NUM), CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_ipc_irq_handler);
            /* No IRQ enable, as it will be done before each time interrupt is needed */
        }
    }
    #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */

    return result;
}

void cyhal_ipc_semaphore_free(cyhal_ipc_t *obj)
{
    #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
    if (NULL != obj->rtos_sema)
    {
        (void)cy_rtos_deinit_semaphore(&((_cyhal_ipc_rtos_sema_t *)obj->rtos_sema)->semaphore);
        ((_cyhal_ipc_rtos_sema_t *)obj->rtos_sema)->initialized = false;
        ((_cyhal_ipc_rtos_sema_t *)obj->rtos_sema)->sema_num = 0;
        obj->rtos_sema = NULL;
    }
    #else
    CY_UNUSED_PARAMETER(obj);
    #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) or other */
}

cy_rslt_t cyhal_ipc_semaphore_take(cyhal_ipc_t *obj, uint32_t timeout_us)
{
    CY_ASSERT(NULL != obj);
    return _cyhal_ipc_sema_take(obj, &timeout_us, CYHAL_IPC_POLLING_INTERVAL_uS);
}

