RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_ipc.c
cy_rslt_t cyhal_ipc_semaphore_give(cyhal_ipc_t *obj)
{
    CY_ASSERT(NULL != obj);
    cy_en_ipcsema_status_t ipc_sema_result = Cy_IPC_Sema_Clear(obj->sema_number, obj->sema_preemptable);
    cy_rslt_t result = ((CY_IPC_SEMA_SUCCESS == ipc_sema_result) || (CY_IPC_SEMA_NOT_ACQUIRED == ipc_sema_result)) ?
            CY_RSLT_SUCCESS : (cy_rslt_t)ipc_sema_result;
    #if (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0)
    if ((obj->sema_number < _CYHAL_IPC_RELEASE_INTR_BITS) && (CY_IPC_SEMA_SUCCESS == ipc_sema_result))
    {
        IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(_CYHAL_IPC_SEMA_INTR_STR_NUM);
        Cy_IPC_Drv_SetInterrupt(ipc_intr_base, 1 << obj->sema_number, 0);
    }
    #endif /* (defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)) && (CYHAL_IPC_RTOS_SEMA_NUM > 0) */
    return result;
}

/***************************************** QUEUES PUBLIC FUNCTIONS ****************************************************/

cy_rslt_t cyhal_ipc_queue_init(cyhal_ipc_t *obj, cyhal_ipc_queue_t *queue_handle)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != queue_handle);
    CY_ASSERT(NULL != queue_handle->queue_pool);

    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Queue IPC channel number and number of items check */
    if ((false == _CYHAL_IPC_CHAN_IDX_CORRECT(queue_handle->channel_num)) || (queue_handle->num_items == 0) ||
            (queue_handle->item_size == 0))
    {
        return CYHAL_IPC_RSLT_ERR_INVALID_PARAMETER;
    }

    uint32_t channel = queue_handle->channel_num;
    if (false == _cyhal_ipc_check_queue_number_used(queue_handle))
    {
        memset(obj, 0, sizeof(cyhal_ipc_t));

        result = _cyhal_ipc_sema_init(obj, _CYHAL_IPC_PDL_SEMA_COUNT - 1, false);
        if (CY_RSLT_SUCCESS == result)
        {
            /* If this is first IPC object being initialized,
            *  we need to clear isr_clear_sync and isr_enable_sync flags, as the are
            *  located in shared memory, which is not being cleared upon initialization.
            *
            *  In addition, clear all IPC HAL user - available IPC channels' data to prevent
            *  cyhal_queue_get_handle calls read random value and treat it as _cyhal_ipc_sevice_data_t struct pointer
            */
            if (NULL == _cyhal_ipc_service_data)
            {
                CY_SECTION_SHAREDMEM
                static uint8_t isr_clear_sync[_CYHAL_IPC_CORE_NUM]
                #if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
                CY_ALIGN(__SCB_DCACHE_LINE_SIZE)
                #endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
                ;
                CY_SECTION_SHAREDMEM
                static uint8_t isr_enable_sync[_CYHAL_IPC_CORE_NUM]
                #if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
                CY_ALIGN(__SCB_DCACHE_LINE_SIZE)
                #endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
                ;
                CY_SECTION_SHAREDMEM
                static _cyhal_ipc_sevice_data_t ipc_service_data
                #if (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)
                CY_ALIGN(__SCB_DCACHE_LINE_SIZE)
                #endif /* (CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE) */
                ;

                memset(isr_clear_sync, 0, sizeof(isr_clear_sync));
                memset(isr_enable_sync, 0, sizeof(isr_enable_sync));

                ipc_service_data.isr_clear_sync = isr_clear_sync;
                ipc_service_data.isr_enable_sync = isr_enable_sync;
                ipc_service_data.queues_ll_pointer = NULL;
                _cyhal_ipc_service_data = &ipc_service_data;

                for (uint32_t chan_idx = CYHAL_IPC_CHAN_0; chan_idx < CYHAL_IPC_CHAN_0 + CYHAL_IPC_USR_CHANNELS; ++chan_idx)
                {
                    IPC_STRUCT_Type *cur_chan_ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(chan_idx);
                    Cy_IPC_Drv_WriteDataValue(cur_chan_ipc_base, 0);
                }

                for (uint8_t obj_idx = 0; obj_idx < CYHAL_IPC_USR_CHANNELS; ++obj_idx)
                {
                    _ipc_objects[obj_idx] = NULL;
                }
            }

            _cyhal_ipc_add_queue_element(obj, queue_handle);

            obj->callback_data.callback = NULL;
            obj->callback_data.callback_arg = NULL;
            obj->user_events = CYHAL_IPC_NO_INTR;
            obj->processed_events = CYHAL_IPC_NO_INTR;

            IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(channel);
            Cy_IPC_Drv_WriteDataValue(ipc_base, (uint32_t)_cyhal_ipc_service_data);

            if (false == interrupts_initialized)
            {
                _cyhal_irq_register(_CYHAL_IPC_CURRENT_CORE_IPC_INTR_SRC, CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_ipc_irq_handler);
                _cyhal_irq_enable(_CYHAL_IPC_CURRENT_CORE_IPC_INTR_SRC);
                interrupts_initialized = true;
            }

            obj->prev_object = _CYHAL_IPC_OBJ_ARR_EL(channel);
            _CYHAL_IPC_OBJ_ARR_EL(channel) = obj;
        }
    }
    else
    {
        return CYHAL_IPC_RSLT_ERR_QUEUE_NUM_IN_USE;
    }
    return result;
}

void cyhal_ipc_queue_free(cyhal_ipc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->queue_obj);

    uint32_t channel = obj->queue_obj->channel_num;

    if (NULL != _cyhal_ipc_service_data->queues_ll_pointer)
    {
        cyhal_ipc_queue_t *current_queue_obj = _cyhal_ipc_service_data->queues_ll_pointer;

        /* Queue element to be deleted is the first one in the linked list */
        if (_cyhal_ipc_service_data->queues_ll_pointer == obj->queue_obj)
        {
            uint32_t timeout = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;
            while (CY_RSLT_SUCCESS != _cyhal_ipc_sema_take(obj, &timeout, _CYHAL_IPC_SERVICE_SEMA_STEP_US))
            {
                timeout = _CYHAL_IPC_SERVICE_SEMA_TIMEOUT_US;;
            }
            _cyhal_ipc_service_data->queues_ll_pointer = obj->queue_obj->next_queue_obj;
            while (CY_RSLT_SUCCESS != cyhal_ipc_semaphore_give(obj)) { cyhal_system_delay_us(_CYHAL_IPC_SERVICE_SEMA_STEP_US); }
        }
        else
        {
            while (NULL != current_queue_obj)
            {
                if (current_queue_obj->next_queue_obj == obj->queue_obj)
                {
                    IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(current_queue_obj->next_queue_obj->channel_num);
                    /* Locking IPC channel before modifying one of its queues */
                    _cyhal_ipc_wait_lock_acquire(ipc_base, NULL, true);
                    current_queue_obj->next_queue_obj = current_queue_obj->next_queue_obj->next_queue_obj;
                    (void)Cy_IPC_Drv_LockRelease(ipc_base, 0);
                    break;
                }
                current_queue_obj = current_queue_obj->next_queue_obj;
            }
        }
    }

    cyhal_ipc_t *curr_ipc_obj = _CYHAL_IPC_OBJ_ARR_EL(channel);
    if (curr_ipc_obj == obj)
    {
        _CYHAL_IPC_OBJ_ARR_EL(channel) = obj->prev_object;
    }
    else
    {
        while (NULL != curr_ipc_obj)
        {
            if (curr_ipc_obj->prev_object == obj)
            {
                curr_ipc_obj->prev_object = curr_ipc_obj->prev_object->prev_object;
                break;
            }
            curr_ipc_obj = curr_ipc_obj->prev_object;
        }
    }

    cyhal_ipc_semaphore_free(obj);
    memset(obj, 0, sizeof(cyhal_ipc_t));
}

cy_rslt_t cyhal_ipc_queue_get_handle(cyhal_ipc_t *obj, uint32_t channel_num, uint32_t queue_num)
{
    CY_ASSERT(NULL != obj);

    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Queue IPC channel number check */
    if (false == _CYHAL_IPC_CHAN_IDX_CORRECT(channel_num))
    {
        return CYHAL_IPC_RSLT_ERR_INVALID_PARAMETER;
    }

    if (NULL == _cyhal_ipc_service_data)
    {
        /* Getting shared memory memory pointer to the first element of queues linked list */
        IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(channel_num);
        _cyhal_ipc_service_data = (_cyhal_ipc_sevice_data_t *)Cy_IPC_Drv_ReadDataValue(ipc_base);
        if ((NULL == _cyhal_ipc_service_data) || (NULL == _cyhal_ipc_service_data->queues_ll_pointer))
        {
            return CYHAL_IPC_RSLT_ERR_QUEUE_NOT_FOUND;
        }
        for (uint8_t obj_idx = 0; obj_idx < CYHAL_IPC_USR_CHANNELS; ++obj_idx)
        {
            _ipc_objects[obj_idx] = NULL;
        }
    }

    if (NULL != _cyhal_ipc_service_data->queues_ll_pointer)
    {
        bool queue_obj_found = false;
        cyhal_ipc_queue_t *queue_ptr = _cyhal_ipc_service_data->queues_ll_pointer;

        while (queue_ptr != NULL)
        {
            if ((queue_ptr->channel_num == channel_num) && (queue_ptr->queue_num == queue_num))
            {
                queue_obj_found = true;
                break;
            }
            queue_ptr = queue_ptr->next_queue_obj;
        }

        if (queue_obj_found)
        {
            memset(obj, 0, sizeof(cyhal_ipc_t));
            obj->callback_data.callback = NULL;
            obj->callback_data.callback_arg = NULL;
            obj->user_events = CYHAL_IPC_NO_INTR;
            obj->processed_events = CYHAL_IPC_NO_INTR;
            obj->queue_obj = queue_ptr;
            obj->prev_object = _CYHAL_IPC_OBJ_ARR_EL(channel_num);
            _CYHAL_IPC_OBJ_ARR_EL(channel_num) = obj;

            result = _cyhal_ipc_sema_init(obj, _CYHAL_IPC_PDL_SEMA_COUNT - 1, false);

            if ((CY_RSLT_SUCCESS == result) && (false == interrupts_initialized))
            {
                _cyhal_irq_register(_CYHAL_IPC_CURRENT_CORE_IPC_INTR_SRC, CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_ipc_irq_handler);
                _cyhal_irq_enable(_CYHAL_IPC_CURRENT_CORE_IPC_INTR_SRC);
                interrupts_initialized = true;
            }
        }
        else
        {
            result = CYHAL_IPC_RSLT_ERR_QUEUE_NOT_FOUND;
        }
    }
    return result;
}

void cyhal_ipc_queue_register_callback(cyhal_ipc_t *obj, cyhal_ipc_event_callback_t callback, void *callback_arg)
{
    CY_ASSERT(NULL != obj);
    obj->callback_data.callback = (cy_israddress) callback;
    obj->callback_data.callback_arg = callback_arg;
}

void cyhal_ipc_queue_enable_event(cyhal_ipc_t *obj, cyhal_ipc_event_t event, uint8_t intr_priority, bool enable)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->queue_obj);

    uint32_t channel = obj->queue_obj->channel_num;
    IPC_INTR_STRUCT_Type *ipc_intr_base = Cy_IPC_Drv_GetIntrBaseAddr(_CYHAL_IPC_CURRENT_CORE_IPC_INTR_CHAN);

    if (enable)
    {
        IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(channel);
        _cyhal_ipc_wait_lock_acquire(ipc_base, NULL, true);
        uint32_t event_and_sign_mask = (event << _CYHAL_IPC_EVENTS_SIGNATURES_BITS) | event;
        /* Extract event in question and its signature from current queue triggered events and copy such bits into
        *  obj->processed_events, so callback will not be called for currently pending (but being now activated) events. */
        obj->processed_events =
                (obj->processed_events & ~event_and_sign_mask) | (obj->queue_obj->triggered_events & event_and_sign_mask);
        (void)Cy_IPC_Drv_LockRelease(ipc_base, 0);

        obj->user_events |= event;
    }
    else
    {
        obj->user_events &= ~event;
    }

    _cyhal_system_irq_t irqn = _CYHAL_IPC_CURRENT_CORE_IPC_INTR_SRC;
    /* As one IPC INTR structure service all IPC channels on certain core, we can't change interrupt priority
    *  for all channels as requested, we can only make it higher. */
    if (intr_priority < _cyhal_irq_get_priority(irqn))
    {
        _cyhal_irq_set_priority(irqn, intr_priority);
    }

    uint32_t current_ipc_interrupt_mask = Cy_IPC_Drv_GetInterruptMask(ipc_intr_base);
    uint32_t channel_intr_mask = (1UL << channel);
    if (CYHAL_IPC_NO_INTR != obj->user_events)
    {
        if ((current_ipc_interrupt_mask & channel_intr_mask) == 0)
        {
            /* This interrupt was not yet enabled before */
            (void)_cyhal_ipc_enable_interrupt(obj, channel, true);
        }
    }
    else
    {
        /* Go through all queues, which tied to current channel and check they have no events activated either */
        uint32_t all_queues_events = CYHAL_IPC_NO_INTR;
        cyhal_ipc_t *obj_to_check = _CYHAL_IPC_OBJ_ARR_EL(channel);

        while (NULL != obj_to_check)
        {
            all_queues_events |= obj_to_check->user_events;
            /* When at least one obj has events enabled, no reason to continue and waste CPU cycles */
            if (CYHAL_IPC_NO_INTR != all_queues_events)
            {
                break;
            }
            obj_to_check = obj_to_check->prev_object;
        }

        /* All channel-related queues have no events enabled, disabling interrupt */
        if (CYHAL_IPC_NO_INTR == all_queues_events)
        {
            (void)_cyhal_ipc_enable_interrupt(obj, channel, false);
        }
    }
}

cy_rslt_t cyhal_ipc_queue_put(cyhal_ipc_t *obj, void *msg, uint32_t timeout_us)
{
    return _cyhal_ipc_queue_put_get(obj, msg, timeout_us, true);
}

cy_rslt_t cyhal_ipc_queue_get(cyhal_ipc_t *obj, void *msg, uint32_t timeout_us)
{
    return _cyhal_ipc_queue_put_get(obj, msg, timeout_us, false);
}

uint32_t cyhal_ipc_queue_count(cyhal_ipc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->queue_obj);
    uint32_t channel = obj->queue_obj->channel_num;
    IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(channel);
    (void)_cyhal_ipc_wait_lock_acquire(ipc_base, NULL, true);
    uint32_t curr_items = obj->queue_obj->curr_items;
    (void)Cy_IPC_Drv_LockRelease(ipc_base, 0);
    return curr_items;
}

cy_rslt_t cyhal_ipc_queue_reset(cyhal_ipc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->queue_obj);

    cyhal_ipc_queue_t *queue_handle = obj->queue_obj;
    uint32_t channel = obj->queue_obj->channel_num;
    IPC_STRUCT_Type *ipc_base = Cy_IPC_Drv_GetIpcBaseAddress(channel);

    cy_rslt_t result = _cyhal_ipc_wait_lock_acquire(ipc_base, NULL, true);

    if (CY_RSLT_SUCCESS == result)
    {
        queue_handle->curr_items = 0;
        queue_handle->queue_head = queue_handle->queue_pool;
        queue_handle->queue_tail = queue_handle->queue_pool;
        _CYHAL_IPC_ADD_TRIGGERED_EVENT(queue_handle->triggered_events, CYHAL_IPC_QUEUE_RESET);
        (void)Cy_IPC_Drv_LockRelease(ipc_base, _CYHAL_IPC_TRIGGER_ISR_MASK);
    }

    return result;
}

#if defined(__cplusplus)
}
#endif

#endif /* CYHAL_DRIVER_AVAILABLE_IPC */
